#include"display.h"


void menu()
{
   // system("pause");
    system("clear");
    printf("*****************************************************************\n");
    printf("*\t\t\t学生成绩管理系统\t\t\t*\n");
    printf("*****************************************************************\n");
    printf("*\t\t\t请选择\t\t\t\t\t*\n");
    printf("*****************************************************************\n");
    printf("*\t\t\t1.录入学生信息\t\t\t\t*\n");
    printf("*\t\t\t2.显示学生信息\t\t\t\t*\n");
    printf("*\t\t\t3.保存学生信息\t\t\t\t*\n");
    printf("*\t\t\t4.读取学生信息\t\t\t\t*\n");
    printf("*\t\t\t5.查找学生信息\t\t\t\t*\n");
    printf("*\t\t\t6.修改学生信息\t\t\t\t*\n");
    printf("*\t\t\t7.删除学生信息\t\t\t\t*\n");
    printf("*\t\t\t8.退出系统\t\t\t\t*\n");
    printf("*****************************************************************\n");
}

void queuemenu()
{
   // system("pause");
    system("clear");
    printf("*****************************************************************\n");
    printf("*\t\t\t学生成绩管理系统\t\t\t*\n");
    printf("*****************************************************************\n");
    printf("*\t\t\t请选择\t\t\t\t\t*\n");
    printf("*****************************************************************\n");
    printf("*\t\t\t1.读取学生信息\t\t\t\t*\n");
    printf("*\t\t\t2.显示学生信息\t\t\t\t*\n");
    printf("*\t\t\t3.查找学生信息\t\t\t\t*\n");
    printf("*\t\t\t4.退出系统\t\t\t\t*\n");
    printf("*****************************************************************\n");
}

void stackmenu()
{
    system("clear");
    printf("*****************************************************************\n");
    printf("*\t\t\t学生成绩管理系统\t\t\t*\n");
    printf("*****************************************************************\n");
    printf("*\t\t\t请选择\t\t\t\t\t*\n");
    printf("*****************************************************************\n");
    printf("*\t\t\t1.我是老师\t\t\t\t*\n");
    printf("*\t\t\t2.我是学生\t\t\t\t*\n");
    printf("*****************************************************************\n");
}

void choicemenu()
{
    system("clear");
    printf("*****************************************************************\n");
    printf("*\t\t\t学生成绩管理系统\t\t\t*\n");
    printf("*****************************************************************\n");
    printf("*\t\t\t请选择\t\t\t\t\t*\n");
    printf("*****************************************************************\n");
    printf("*\t\t\t1.登录\t\t\t\t\t*\n");
    printf("*\t\t\t2.注册\t\t\t\t\t*\n");
    printf("*\t\t\t3.退出\t\t\t\t\t*\n");
    printf("*****************************************************************\n");
}
        


