#include<stdio.h>
#include<stdlib.h>


void menu();




int main(int argc,char **argv)
{
	menu();
	return 0;
}
	
	
	
	
	
	
	
	
	
	void menu(){


     
	   printf("*********************xiao guai  guai*********************\n");
	   printf("***************  please input number 1-10*******************\n");
	   printf("*********************一个数字就是一句话*******************\n");
	   printf("*********************这是几句话*********************\n");
	   printf("*********************我突然有的灵感*********************\n");
	   printf("*********************我也不知道为什么会写*********************\n");
	   printf("*********************可能是属于我的突然的感性*********************\n");
	   printf("*********************但确实是我的想法*********************\n");
	   printf("*********************所以讲给你听*********************\n");
	   printf("*********************^^^^-- ^^^^*********************\n");	   
   while(1){
	   int option;
	  scanf("%d",&option);
	  switch(option){
		  case 1:{
					 printf("这几天的话很少，有时我是想多和你聊聊但不知道说些什么，可能是因为太默契了。\n");break;
				 }
          case 2:{
					 printf("不过我这几天还挺想你的，不过你和我都挺忙的，略略略。\n");break;
				 }
		  case 3:{
					 printf("你最近喉咙痛，我有时会想是不是我带你去吃上火的还是有点心疼和自责的。\n");break;
				 }
          case 4:{
					 printf("不管是不是这个原因，你最近吃东西还是注意注意哦。\n");break;
				 }
          case 5:{
					 printf("学习虽然很重要，不过还是要注意休息，身体就是本钱，晓得不？\n");break;
				 }
          case 6:{
					 printf("虽然胃口不好，但不吃饭的话也要喝点粥之类的，养养胃。\n");break;
				 }
          case 7:{
					 printf("还有，你今天的衣服是啥时候的，都起球了，这么节省的嘛，哈哈哈\n");break;
				 }
          case 8:{
					 printf("突然不知道说些什么了，那就这样吧，晚安\n");break;
				 }
          case 9:{
					 printf("LOVE\n");break;
				 }
          case 10:{
					  printf("good night!,小乖乖要想我哦。\n");break;
				  }
        default:{
					printf("输错了，笨笨。\n");
					break;		}
	       }     
   

   } 

	} 





